Revit 2027 API
PropertySetupType Enumeration
 An enumerated type listing the types of property sets stored in the template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PropertySetupType
Public Enumeration PropertySetupType
public enum class PropertySetupType
type PropertySetupType
Members
Member name | Value | Description
IfcBaseQuantities | 2 |  The base quantities.
IfcCommonPropertySets | 0 |  The IFC common property sets.
RevitElementParameters | 1 |  The Revit element parameters.
RevitMaterialParameters | 3 |  The Revit material parameters.
RevitSchedules | 4 |  The Revit schedules.
UserDefinedPropertySets | 5 |  The user-defined property sets.
See Also
Reference
Autodesk.Revit.DB Namespace